posts/reactive-stream/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Reactive Streams | Warren Liu</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reactive-stream/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../scala-note/" title="Scala Note" type="text/html">
<link rel="next" href="../programming-note/" title="Programming Notes" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Reactive Streams">
<meta property="og:url" content="https://example.com/posts/reactive-stream/">
<meta property="og:description" content='Problem


Handling streams of data – especially "live" data whose volumn is
not predetermined – requires special care in an asynchronous system.

The most prominent issue is that resource consumption '>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-14T00:00:00+01:00">
<meta property="article:tag" content="reactive stream">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Reactive Streams</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-14T00:00:00+01:00" itemprop="datePublished" title="2017-07-14 00:00">2017-07-14 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Problem</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Handling streams of data – especially "live" data whose volumn is
not predetermined – requires special care in an asynchronous system.
</li>
<li>The most prominent issue is that <b>resource consumption</b> needs to be
controlled such that a <i>fast data source does not overwhelm the steam
destination</i>.
</li>
<li>The main goal is to govern the exchange of stream data across an
asynchronous boundary, while ensuring that the receiving side is not
forced to buffer arbitrary amounts of data.
<ul class="org-ul">
<li>Back pressure is an integral part of this modl in order to allow
the queue which mediate between threads to be <b>bounded</b>.
</li>
</ul>
</li>
<li>In summary, Reactive Streams is a standard and specification for
Stream-oriented libraries for the JVM that:
<ul class="org-ul">
<li>process a potentially <b>unbounded number</b> of elements,
</li>
<li>in sequence,
</li>
<li>
<b>asynchronously</b> passing elements between components,
</li>
<li>with <b>mandatory</b> <i>non-blocking backpressure</i>.
</li>
</ul>
</li>
<li>Publisher: a provider of a potentially unbounded number of sequenced
elements, publishing them according to the *demand received from its
Subscriber(S).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">RxJava 2</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/ReactiveX/RxJava">https://github.com/ReactiveX/RxJava</a>
</p>
<ul class="org-ul">
<li>RxJava 2 implements Reactive-Streams API.
</li>
<li>RxJava 2 features several base classes you can discover operators on:
<ul class="org-ul">
<li>
<code>io.reactivex.Flowable</code> : 0..N flows, supporting Reactive-Streams and backpressure
</li>
<li>
<code>io.reactivex.Observable</code>: 0..N flows, no backpressure
</li>
<li>
<code>io.reactivex.Single</code>: a flow of exactly 1 item or an error
</li>
<li>
<code>io.reactivex.Completable</code>: a flow without items but only a completion or error signal
</li>
<li>
<code>io.reactivex.Maybe</code>: a flow with no items, exactly one item or an
error.
</li>
</ul>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/reactive-stream/" rel="tag">reactive stream</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../scala-note/" rel="prev" title="Scala Note">Previous post</a>
            </li>
            <li class="next">
                <a href="../programming-note/" rel="next" title="Programming Notes">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
